"""
# 실습1. 어머니와 아버지의 이름을 각각 다른 변수에 저장해보자. 또, 자신의 이름도 변수에 저장해보자
mom_name = "___"
dad_name = "___"
my_name = "___"

# 실습2. "저의 이름은 ___이고, 아버지 성함은 ___, 어머니 성함은 ___입니다."의 형태로 출력해보도록하자.
print("저의 이름은 ", my_name, "이고, 아버지 성함은 ", dad_name, ", 어머니 성함은 ", mom_name, "입니다.", sep='')

여기서 생기는 의문점. 좀 더 간편하게 작성하고 싶은데 어떻게 하면 좋을까?
-> 포맷팅을 이용하자!

포맷팅의 종류는 3가지가 있다. 하지만 우리는 f-문자열 포맷팅만 배울 것.
print(f"{$[변수명]}")

# 실습3. 실습2의 코드를 좀 더 간결하게 짜보자.
print(f"저의 이름은 {my_name}이고, 아버지 성함은 {dad_name}, 어머니 성함은 {mom_name}입니다.")
"""

if __name__ == '__main__':
    def main():
        pass


    main()
